#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_Interation

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BPUI_Interation.BPUI_Interation_C.ExecuteUbergraph_BPUI_Interation
// 0x0060 (0x0060 - 0x0000)
struct BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayMessageSimpleMessage          CallFunc_MakeLiteralSimpleMessageWithInt_ReturnValue; // 0x0010(0x0020)()
	struct FGameplayMessageSimpleMessage          CallFunc_MakeLiteralSimpleMessageWithInt_ReturnValue_1; // 0x0030(0x0020)()
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation;

// Function BPUI_Interation.BPUI_Interation_C.OnTimerCountCallBack
// 0x0008 (0x0008 - 0x0000)
struct BPUI_Interation_C_OnTimerCountCallBack final
{
public:
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_Interation_C_OnTimerCountCallBack;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
