#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_SettingOptionSlot

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPUI_SettingOptionSlot.BPUI_SettingOptionSlot_C.ExecuteUbergraph_BPUI_SettingOptionSlot
// 0x0004 (0x0004 - 0x0000)
struct BPUI_SettingOptionSlot_C_ExecuteUbergraph_BPUI_SettingOptionSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_SettingOptionSlot_C_ExecuteUbergraph_BPUI_SettingOptionSlot;

// Function BPUI_SettingOptionSlot.BPUI_SettingOptionSlot_C.GetDisplayKeyFormattedText
// 0x0120 (0x0120 - 0x0000)
struct BPUI_SettingOptionSlot_C_GetDisplayKeyFormattedText final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          bDoesAltRequired;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_GetKeyDisplay_bFound;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetKeyDisplay_ReturnValue;                // 0x0038(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0048(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0010)()
	bool                                          CallFunc_GetKeyDisplay_bFound_1;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetKeyDisplay_ReturnValue_1;              // 0x0110(0x0010)()
};
DUMPER7_ASSERTS_BPUI_SettingOptionSlot_C_GetDisplayKeyFormattedText;

}

