#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_AudioSetting

#include "Basic.hpp"

#include "HTGame_structs.hpp"


namespace SDK::Params
{

// Function BPUI_AudioSetting.BPUI_AudioSetting_C.BndEvt__BPUI_Setting_BPUI_Setting_SurroundSound_K2Node_ComponentBoundEvent_45_OnSettingChooseComboBoxOptionDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BPUI_AudioSetting_C_BndEvt__BPUI_Setting_BPUI_Setting_SurroundSound_K2Node_ComponentBoundEvent_45_OnSettingChooseComboBoxOptionDelegate__DelegateSignature final
{
public:
	class UHTUI_SettingOptionSlot*                OptionSlotWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   OptionID;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OptionIndex;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldIndex;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_AudioSetting_C_BndEvt__BPUI_Setting_BPUI_Setting_SurroundSound_K2Node_ComponentBoundEvent_45_OnSettingChooseComboBoxOptionDelegate__DelegateSignature;

// Function BPUI_AudioSetting.BPUI_AudioSetting_C.ExecuteUbergraph_BPUI_AudioSetting
// 0x00B0 (0x00B0 - 0x0000)
struct BPUI_AudioSetting_C_ExecuteUbergraph_BPUI_AudioSetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTGameUserSettings*                    CallFunc_GetHTGameUserSettings_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHTUI_SettingOptionSlot*                K2Node_ComponentBoundEvent_OptionSlotWidget;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_OptionID;               // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OptionIndex;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OldIndex;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSettingOptionComboBoxData             CallFunc_GetSettingOptionComboBoxData_ReturnValue; // 0x0028(0x0080)()
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_AudioSetting_C_ExecuteUbergraph_BPUI_AudioSetting;

}

