#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_LawSetting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_LawSetting.BPUI_LawSetting_C
// 0x0028 (0x0F28 - 0x0F00)
class UBPUI_LawSetting_C final : public UHTUI_LawSetting
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPUI_SettingOptionSlot_C*              BPUI_SettingOptionSlot_CrossPlatform;              // 0x0F08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_SettingOptionSlot_C*              BPUI_SettingOptionSlot_24;                         // 0x0F10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_SettingOptionSlot_C*              BPUI_SettingOptionSlot_3;                          // 0x0F18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_SettingOptionSlot_C*              BPUI_SettingOptionSlot;                            // 0x0F20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__BPUI_LawSetting_BPUI_SettingOptionSlot_1_K2Node_ComponentBoundEvent_1_OnSettingOptionButtonClickDelegate__DelegateSignature(class UHTUI_SettingOptionSlot* OptionSlotWidget, const class FName& OptionID);
	void BndEvt__BPUI_LawSetting_BPUI_SettingOptionSlot_25_K2Node_ComponentBoundEvent_0_OnSettingChooseComboBoxOptionDelegate__DelegateSignature(class UHTUI_SettingOptionSlot* OptionSlotWidget, const class FName& OptionID, int32 OptionIndex, int32 OldIndex);
	void BndEvt__BPUI_LawSetting_BPUI_SettingOptionSlot_K2Node_ComponentBoundEvent_2_OnSettingOptionButtonClickDelegate__DelegateSignature(class UHTUI_SettingOptionSlot* OptionSlotWidget, const class FName& OptionID);
	void BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_24_K2Node_ComponentBoundEvent_15_OnSettingOptionButtonClickDelegate__DelegateSignature(class UHTUI_SettingOptionSlot* OptionSlotWidget, const class FName& OptionID);
	void BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_26_K2Node_ComponentBoundEvent_17_OnSettingChooseComboBoxOptionDelegate__DelegateSignature(class UHTUI_SettingOptionSlot* OptionSlotWidget, const class FName& OptionID, int32 OptionIndex, int32 OldIndex);
	void BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_3_K2Node_ComponentBoundEvent_14_OnSettingOptionButtonClickDelegate__DelegateSignature(class UHTUI_SettingOptionSlot* OptionSlotWidget, const class FName& OptionID);
	void BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_CrossPlatform_K2Node_ComponentBoundEvent_46_OnSettingChooseComboBoxOptionDelegate__DelegateSignature(class UHTUI_SettingOptionSlot* OptionSlotWidget, const class FName& OptionID, int32 OptionIndex, int32 OldIndex);
	void Completed_930C2B454714C01FDC4461AB2637C842(class UCommonActivatableWidget* WidgetObject);
	void ExecuteUbergraph_BPUI_LawSetting(int32 EntryPoint);
	void MacForceShowMouse();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPUI_LawSetting_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPUI_LawSetting_C")
	}
	static class UBPUI_LawSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_LawSetting_C>();
	}
};
DUMPER7_ASSERTS_UBPUI_LawSetting_C;

}

