#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_LawSetting

#include "Basic.hpp"

#include "HTGame_structs.hpp"


namespace SDK::Params
{

// Function BPUI_LawSetting.BPUI_LawSetting_C.BndEvt__BPUI_LawSetting_BPUI_SettingOptionSlot_1_K2Node_ComponentBoundEvent_1_OnSettingOptionButtonClickDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BPUI_LawSetting_C_BndEvt__BPUI_LawSetting_BPUI_SettingOptionSlot_1_K2Node_ComponentBoundEvent_1_OnSettingOptionButtonClickDelegate__DelegateSignature final
{
public:
	class UHTUI_SettingOptionSlot*                OptionSlotWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   OptionID;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_LawSetting_C_BndEvt__BPUI_LawSetting_BPUI_SettingOptionSlot_1_K2Node_ComponentBoundEvent_1_OnSettingOptionButtonClickDelegate__DelegateSignature;

// Function BPUI_LawSetting.BPUI_LawSetting_C.BndEvt__BPUI_LawSetting_BPUI_SettingOptionSlot_25_K2Node_ComponentBoundEvent_0_OnSettingChooseComboBoxOptionDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BPUI_LawSetting_C_BndEvt__BPUI_LawSetting_BPUI_SettingOptionSlot_25_K2Node_ComponentBoundEvent_0_OnSettingChooseComboBoxOptionDelegate__DelegateSignature final
{
public:
	class UHTUI_SettingOptionSlot*                OptionSlotWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   OptionID;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OptionIndex;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldIndex;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_LawSetting_C_BndEvt__BPUI_LawSetting_BPUI_SettingOptionSlot_25_K2Node_ComponentBoundEvent_0_OnSettingChooseComboBoxOptionDelegate__DelegateSignature;

// Function BPUI_LawSetting.BPUI_LawSetting_C.BndEvt__BPUI_LawSetting_BPUI_SettingOptionSlot_K2Node_ComponentBoundEvent_2_OnSettingOptionButtonClickDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BPUI_LawSetting_C_BndEvt__BPUI_LawSetting_BPUI_SettingOptionSlot_K2Node_ComponentBoundEvent_2_OnSettingOptionButtonClickDelegate__DelegateSignature final
{
public:
	class UHTUI_SettingOptionSlot*                OptionSlotWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   OptionID;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_LawSetting_C_BndEvt__BPUI_LawSetting_BPUI_SettingOptionSlot_K2Node_ComponentBoundEvent_2_OnSettingOptionButtonClickDelegate__DelegateSignature;

// Function BPUI_LawSetting.BPUI_LawSetting_C.BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_24_K2Node_ComponentBoundEvent_15_OnSettingOptionButtonClickDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BPUI_LawSetting_C_BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_24_K2Node_ComponentBoundEvent_15_OnSettingOptionButtonClickDelegate__DelegateSignature final
{
public:
	class UHTUI_SettingOptionSlot*                OptionSlotWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   OptionID;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_LawSetting_C_BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_24_K2Node_ComponentBoundEvent_15_OnSettingOptionButtonClickDelegate__DelegateSignature;

// Function BPUI_LawSetting.BPUI_LawSetting_C.BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_26_K2Node_ComponentBoundEvent_17_OnSettingChooseComboBoxOptionDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BPUI_LawSetting_C_BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_26_K2Node_ComponentBoundEvent_17_OnSettingChooseComboBoxOptionDelegate__DelegateSignature final
{
public:
	class UHTUI_SettingOptionSlot*                OptionSlotWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   OptionID;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OptionIndex;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldIndex;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_LawSetting_C_BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_26_K2Node_ComponentBoundEvent_17_OnSettingChooseComboBoxOptionDelegate__DelegateSignature;

// Function BPUI_LawSetting.BPUI_LawSetting_C.BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_3_K2Node_ComponentBoundEvent_14_OnSettingOptionButtonClickDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BPUI_LawSetting_C_BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_3_K2Node_ComponentBoundEvent_14_OnSettingOptionButtonClickDelegate__DelegateSignature final
{
public:
	class UHTUI_SettingOptionSlot*                OptionSlotWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   OptionID;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_LawSetting_C_BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_3_K2Node_ComponentBoundEvent_14_OnSettingOptionButtonClickDelegate__DelegateSignature;

// Function BPUI_LawSetting.BPUI_LawSetting_C.BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_CrossPlatform_K2Node_ComponentBoundEvent_46_OnSettingChooseComboBoxOptionDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BPUI_LawSetting_C_BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_CrossPlatform_K2Node_ComponentBoundEvent_46_OnSettingChooseComboBoxOptionDelegate__DelegateSignature final
{
public:
	class UHTUI_SettingOptionSlot*                OptionSlotWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   OptionID;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OptionIndex;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldIndex;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_LawSetting_C_BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_CrossPlatform_K2Node_ComponentBoundEvent_46_OnSettingChooseComboBoxOptionDelegate__DelegateSignature;

// Function BPUI_LawSetting.BPUI_LawSetting_C.Completed_930C2B454714C01FDC4461AB2637C842
// 0x0008 (0x0008 - 0x0000)
struct BPUI_LawSetting_C_Completed_930C2B454714C01FDC4461AB2637C842 final
{
public:
	class UCommonActivatableWidget*               WidgetObject;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_LawSetting_C_Completed_930C2B454714C01FDC4461AB2637C842;

// Function BPUI_LawSetting.BPUI_LawSetting_C.ExecuteUbergraph_BPUI_LawSetting
// 0x02A8 (0x02A8 - 0x0000)
struct BPUI_LawSetting_C_ExecuteUbergraph_BPUI_LawSetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_WidgetObject;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* WidgetObject)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHTUI_SettingOptionSlot*                K2Node_ComponentBoundEvent_OptionSlotWidget_6;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_OptionID_6;             // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHTUI_CultureManager*                   K2Node_DynamicCast_AsHTUI_Culture_Manager;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTUI_SettingOptionSlot*                K2Node_ComponentBoundEvent_OptionSlotWidget_5;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_OptionID_5;             // 0x0050(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHTOneSDKUtil*                          CallFunc_GetInstance_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHTGameUserSettings*                    CallFunc_GetHTGameUserSettings_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHTUI_SettingOptionSlot*                K2Node_ComponentBoundEvent_OptionSlotWidget_4;     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_OptionID_4;             // 0x0070(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OptionIndex_2;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OldIndex_2;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHTGameUserSettings*                    CallFunc_GetHTGameUserSettings_ReturnValue_1;      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHTUI_SettingOptionSlot*                K2Node_ComponentBoundEvent_OptionSlotWidget_3;     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_OptionID_3;             // 0x0090(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OptionIndex_1;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OldIndex_1;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAudioCulture_ReturnValue;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSettingOptionComboBoxData             CallFunc_GetSettingOptionComboBoxData_ReturnValue; // 0x00B0(0x0080)()
	struct FSettingOptionComboBoxData             CallFunc_GetSettingOptionComboBoxData_ReturnValue_1; // 0x0130(0x0080)()
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTGameUserSettings*                    CallFunc_GetHTGameUserSettings_ReturnValue_2;      // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHTPlatformType                               CallFunc_SwitchPlatform_OutPlatformType;           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTOneSDKUtil*                          CallFunc_GetInstance_ReturnValue_1;                // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChannelID_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTUI_SettingOptionSlot*                K2Node_ComponentBoundEvent_OptionSlotWidget_2;     // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_OptionID_2;             // 0x01E0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OptionIndex;            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OldIndex;               // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSettingOptionComboBoxData             CallFunc_GetSettingOptionComboBoxData_ReturnValue_2; // 0x01F8(0x0080)()
	class UHTUI_SettingOptionSlot*                K2Node_ComponentBoundEvent_OptionSlotWidget_1;     // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_OptionID_1;             // 0x0280(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncShowUIActionBase*                 CallFunc_AsyncShowUIByClass_ReturnValue;           // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOversea_ReturnValue;                    // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTUI_SettingOptionSlot*                K2Node_ComponentBoundEvent_OptionSlotWidget;       // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_OptionID;               // 0x02A0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_LawSetting_C_ExecuteUbergraph_BPUI_LawSetting;

// Function BPUI_LawSetting.BPUI_LawSetting_C.MacForceShowMouse
// 0x0010 (0x0010 - 0x0000)
struct BPUI_LawSetting_C_MacForceShowMouse final
{
public:
	bool                                          CallFunc_IsMac_ReturnValue;                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTUINavigationSubsystem*               CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_LawSetting_C_MacForceShowMouse;

// Function BPUI_LawSetting.BPUI_LawSetting_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPUI_LawSetting_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_LawSetting_C_PreConstruct;

}

