#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_Setting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_Setting.BPUI_Setting_C
// 0x0090 (0x1098 - 0x1008)
class UBPUI_Setting_C final : public UHTUI_Setting
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1008(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_GamepadKeysTips_C*                  WB_GamepadKeysTips;                                // 0x1010(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_106;                                   // 0x1018(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CommonTitleWidget_C*                UI_CommonTitleWidget;                              // 0x1020(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x1028(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Bg_Black_1;                                  // 0x1030(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Bg_Black;                                    // 0x1038(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_395;                                         // 0x1040(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_102;                                         // 0x1048(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBoundActionBar*                  CommonBoundActionBar_0;                            // 0x1050(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HTButton_Com_02_C*                   BtnRestoreKeySetting;                              // 0x1058(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_SettingOptionSlot_C*              BPUI_SettingOptionSlot_8;                          // 0x1060(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_SettingOptionSlot_C*              BPUI_SettingOptionSlot_6;                          // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_SettingOptionSlot_C*              BPUI_SettingOptionSlot_1;                          // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_SettingOptionSlot_C*              BPUI_SettingOptionSlot;                            // 0x1078(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RadioBox_Table_2_C*               BPUI_RadioBox_Table_3;                             // 0x1080(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RadioBox_Table_2_C*               BPUI_RadioBox_Table_1;                             // 0x1088(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RadioBox_Table_2_C*               BPUI_RadioBox_Table;                               // 0x1090(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__BPUI_Setting_BPUI_RadioBox_Table_3_K2Node_ComponentBoundEvent_0_OnRadioBoxUnCheckedEvent__DelegateSignature(class UHTUI_RadioBox* RadioBox);
	void BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_6_K2Node_ComponentBoundEvent_1_OnSettingChooseComboBoxOptionDelegate__DelegateSignature(class UHTUI_SettingOptionSlot* OptionSlotWidget, const class FName& OptionID, int32 OptionIndex, int32 OldIndex);
	void BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_8_K2Node_ComponentBoundEvent_3_OnSettingChooseComboBoxOptionDelegate__DelegateSignature(class UHTUI_SettingOptionSlot* OptionSlotWidget, const class FName& OptionID, int32 OptionIndex, int32 OldIndex);
	void BndEvt__BPUI_Setting_BPUI_SettingOptionSlot_K2Node_ComponentBoundEvent_2_OnSettingChooseComboBoxOptionDelegate__DelegateSignature(class UHTUI_SettingOptionSlot* OptionSlotWidget, const class FName& OptionID, int32 OptionIndex, int32 OldIndex);
	void BndEvt__BPUI_Setting_BtnRestore_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActiveWidgetIndexSet(int32 InIndex);
	bool BP_OnHandleBackAction();
	void Completed_0B4F014D4A1E7F26BA9D62B573C497B9(class UCommonActivatableWidget* WidgetObject);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BPUI_Setting(int32 EntryPoint);
	void MacFroceHideMouse();
	void OnMsgBoxCancelDyamicDelegate_Event();
	void OnMsgBoxSure();
	void OnMsgBoxSureDyamicDelegate_Event();
	void OnSetCommonSubTitle(const class FText& InText);
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent();
	void SequenceEvent__ENTRYPOINTBPUI_Setting();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPUI_Setting_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPUI_Setting_C")
	}
	static class UBPUI_Setting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_Setting_C>();
	}
};
DUMPER7_ASSERTS_UBPUI_Setting_C;

}

