#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_AudioSetting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_AudioSetting.BPUI_AudioSetting_C
// 0x0030 (0x0F08 - 0x0ED8)
class UBPUI_AudioSetting_C final : public UHTUI_AudioSetting
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPUI_SettingOptionSlot_C*              BPUI_SettingOptionSlot_16;                         // 0x0EE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_SettingOptionSlot_C*              BPUI_SettingOptionSlot_15;                         // 0x0EE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_SettingOptionSlot_C*              BPUI_SettingOptionSlot_14;                         // 0x0EF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_SettingOptionSlot_C*              BPUI_SettingOptionSlot_1;                          // 0x0EF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_SettingOptionSlot_C*              BPUI_Setting_SurroundSound;                        // 0x0F00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__BPUI_Setting_BPUI_Setting_SurroundSound_K2Node_ComponentBoundEvent_45_OnSettingChooseComboBoxOptionDelegate__DelegateSignature(class UHTUI_SettingOptionSlot* OptionSlotWidget, const class FName& OptionID, int32 OptionIndex, int32 OldIndex);
	void ExecuteUbergraph_BPUI_AudioSetting(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPUI_AudioSetting_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPUI_AudioSetting_C")
	}
	static class UBPUI_AudioSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_AudioSetting_C>();
	}
};
DUMPER7_ASSERTS_UBPUI_AudioSetting_C;

}

