#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_QuickMenuFragmentActive

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_QuickMenuFragmentActive.WB_QuickMenuFragmentActive_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_QuickMenuFragmentActive_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_QuickMenuFragmentActive_C_PreConstruct;

// Function WB_QuickMenuFragmentActive.WB_QuickMenuFragmentActive_C.ExecuteUbergraph_WB_QuickMenuFragmentActive
// 0x0028 (0x0028 - 0x0000)
struct WB_QuickMenuFragmentActive_C_ExecuteUbergraph_WB_QuickMenuFragmentActive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_QuickMenuFragmentActive_C_ExecuteUbergraph_WB_QuickMenuFragmentActive;

}

