#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_QuickMenuSettings_KeyboardMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_QuickMenuSettings_KeyboardMenu.WB_QuickMenuSettings_KeyboardMenu_C.ExecuteUbergraph_WB_QuickMenuSettings_KeyboardMenu
// 0x0070 (0x0070 - 0x0000)
struct WB_QuickMenuSettings_KeyboardMenu_C_ExecuteUbergraph_WB_QuickMenuSettings_KeyboardMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTUI_QuickMenuSettings_OptionBtn*      CallFunc_GetOptionBtnByIndex_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InbIsEditing;                         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlay*                               K2Node_Event_InOverlay_1;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index_1;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_K2_GetFragmentWidgetByIndexFrom_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               K2Node_Event_InOverlay;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuickMenuFragmentActive_C*          K2Node_DynamicCast_AsWB_Quick_Menu_Fragment_Active; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_K2_GetFragmentWidgetByIndexFrom_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWB_QuickMenuFragmentActive_C*          K2Node_DynamicCast_AsWB_Quick_Menu_Fragment_Active_1; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_QuickMenuSettings_KeyboardMenu_C_ExecuteUbergraph_WB_QuickMenuSettings_KeyboardMenu;

// Function WB_QuickMenuSettings_KeyboardMenu.WB_QuickMenuSettings_KeyboardMenu_C.BP_OnOptionButtonSelected
// 0x0020 (0x0020 - 0x0000)
struct WB_QuickMenuSettings_KeyboardMenu_C_BP_OnOptionButtonSelected final
{
public:
	class UHTUI_QuickMenuSettings_OptionBtn*      OptionButton;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSelectedId_ReturnValue;                // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditing_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSelectedId_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_QuickMenuSettings_KeyboardMenu_C_BP_OnOptionButtonSelected;

// Function WB_QuickMenuSettings_KeyboardMenu.WB_QuickMenuSettings_KeyboardMenu_C.BP_OnEditorModeStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WB_QuickMenuSettings_KeyboardMenu_C_BP_OnEditorModeStateChanged final
{
public:
	bool                                          InbIsEditing;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_QuickMenuSettings_KeyboardMenu_C_BP_OnEditorModeStateChanged;

// Function WB_QuickMenuSettings_KeyboardMenu.WB_QuickMenuSettings_KeyboardMenu_C.BP_DeactivateFragmentWidget
// 0x0010 (0x0010 - 0x0000)
struct WB_QuickMenuSettings_KeyboardMenu_C_BP_DeactivateFragmentWidget final
{
public:
	class UOverlay*                               InOverlay;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_QuickMenuSettings_KeyboardMenu_C_BP_DeactivateFragmentWidget;

// Function WB_QuickMenuSettings_KeyboardMenu.WB_QuickMenuSettings_KeyboardMenu_C.BP_ActivateFragmentWidget
// 0x0010 (0x0010 - 0x0000)
struct WB_QuickMenuSettings_KeyboardMenu_C_BP_ActivateFragmentWidget final
{
public:
	class UOverlay*                               InOverlay;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_QuickMenuSettings_KeyboardMenu_C_BP_ActivateFragmentWidget;

}

