#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_RadioBox_Table_2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPUI_RadioBox_Table_2.BPUI_RadioBox_Table_2_C.BndEvt__BPUI_RadioBox_Table_W_HTButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_RadioBox_Table_2_C_BndEvt__BPUI_RadioBox_Table_W_HTButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_RadioBox_Table_2_C_BndEvt__BPUI_RadioBox_Table_W_HTButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function BPUI_RadioBox_Table_2.BPUI_RadioBox_Table_2_C.BndEvt__BPUI_RadionBox_Table_RadioBox_K2Node_ComponentBoundEvent_4_OnUnSelectedDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_RadioBox_Table_2_C_BndEvt__BPUI_RadionBox_Table_RadioBox_K2Node_ComponentBoundEvent_4_OnUnSelectedDelegate__DelegateSignature final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_RadioBox_Table_2_C_BndEvt__BPUI_RadionBox_Table_RadioBox_K2Node_ComponentBoundEvent_4_OnUnSelectedDelegate__DelegateSignature;

// Function BPUI_RadioBox_Table_2.BPUI_RadioBox_Table_2_C.ExecuteUbergraph_BPUI_RadioBox_Table_2
// 0x0150 (0x0150 - 0x0000)
struct BPUI_RadioBox_Table_2_C_ExecuteUbergraph_BPUI_RadioBox_Table_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_InWidget;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0048(0x0080)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C8(0x0080)(ConstParm)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPUI_RadioBox_Table_2_C_ExecuteUbergraph_BPUI_RadioBox_Table_2;

// Function BPUI_RadioBox_Table_2.BPUI_RadioBox_Table_2_C.OnMouseEnter
// 0x00B8 (0x00B8 - 0x0000)
struct BPUI_RadioBox_Table_2_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BPUI_RadioBox_Table_2_C_OnMouseEnter;

// Function BPUI_RadioBox_Table_2.BPUI_RadioBox_Table_2_C.OnMouseLeave
// 0x0080 (0x0080 - 0x0000)
struct BPUI_RadioBox_Table_2_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BPUI_RadioBox_Table_2_C_OnMouseLeave;

}

