#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CommonTitleWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CommonTitleWidget.UI_CommonTitleWidget_C
// 0x0038 (0x0F70 - 0x0F38)
class UUI_CommonTitleWidget_C final : public UHTUI_CommonTitleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Yuan_03;                                     // 0x0F40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0F48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_481;                                         // 0x0F50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           ParticleColor;                                     // 0x0F58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        LightColor;                                        // 0x0F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void BP_Close_Anim();
	void BP_Open_Anim();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_UI_CommonTitleWidget(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_CommonTitleWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_CommonTitleWidget_C")
	}
	static class UUI_CommonTitleWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CommonTitleWidget_C>();
	}
};
DUMPER7_ASSERTS_UUI_CommonTitleWidget_C;

}

