#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CommonTitleWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_CommonTitleWidget.UI_CommonTitleWidget_C.BP Close Anim
// 0x0010 (0x0010 - 0x0000)
struct UI_CommonTitleWidget_C_BP_Close_Anim final
{
public:
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CommonTitleWidget_C_BP_Close_Anim;

// Function UI_CommonTitleWidget.UI_CommonTitleWidget_C.BP Open Anim
// 0x0010 (0x0010 - 0x0000)
struct UI_CommonTitleWidget_C_BP_Open_Anim final
{
public:
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CommonTitleWidget_C_BP_Open_Anim;

// Function UI_CommonTitleWidget.UI_CommonTitleWidget_C.ExecuteUbergraph_UI_CommonTitleWidget
// 0x0060 (0x0060 - 0x0000)
struct UI_CommonTitleWidget_C_ExecuteUbergraph_UI_CommonTitleWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CommonTitleWidget_C_ExecuteUbergraph_UI_CommonTitleWidget;

// Function UI_CommonTitleWidget.UI_CommonTitleWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_CommonTitleWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CommonTitleWidget_C_Tick;

}

