#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_QuickMenuFragmentActive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_QuickMenuFragmentActive.WB_QuickMenuFragmentActive_C
// 0x0028 (0x0618 - 0x05F0)
class UWB_QuickMenuFragmentActive_C final : public UHTUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 FragmentActive;                                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       AniAppear;                                         // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AniDisappear;                                      // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ActiveTexture;                                     // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_QuickMenuFragmentActive(int32 EntryPoint);
	void PlayAppearAnim();
	void PlayDisappearAnim();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_QuickMenuFragmentActive_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_QuickMenuFragmentActive_C")
	}
	static class UWB_QuickMenuFragmentActive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_QuickMenuFragmentActive_C>();
	}
};
DUMPER7_ASSERTS_UWB_QuickMenuFragmentActive_C;

}

