#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_QuickMenuSettings_OptionBtn

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_QuickMenuSettings_OptionBtn.WB_QuickMenuSettings_OptionBtn_C.BP_OnSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WB_QuickMenuSettings_OptionBtn_C_BP_OnSelectionChanged final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_QuickMenuSettings_OptionBtn_C_BP_OnSelectionChanged;

// Function WB_QuickMenuSettings_OptionBtn.WB_QuickMenuSettings_OptionBtn_C.ExecuteUbergraph_WB_QuickMenuSettings_OptionBtn
// 0x001C (0x001C - 0x0000)
struct WB_QuickMenuSettings_OptionBtn_C_ExecuteUbergraph_WB_QuickMenuSettings_OptionBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelected;                            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_QuickMenuSettings_OptionBtn_C_ExecuteUbergraph_WB_QuickMenuSettings_OptionBtn;

}

