#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_QuickMenuSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_QuickMenuSettings.WB_QuickMenuSettings_C
// 0x0038 (0x0680 - 0x0648)
class UWB_QuickMenuSettings_C final : public UHTUI_QuickMenuSettings
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        QuickMenuSwitcher;                                 // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageNameLine;                                     // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHTKeysAction*                          HTKeysAction_34;                                   // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelQuickMenu;                              // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HTButton_Com_02_C*                   BtnSave;                                           // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHTUI_QuickMenuSettings_Menu*           QuickMenu;                                         // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WB_QuickMenuSettings_BtnRestore_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_QuickMenuSettings_BtnSave_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_QuickMenuSettings_HTKeysAction_34_K2Node_ComponentBoundEvent_0_OnClickedDelegate__DelegateSignature();
	void BP_OnEditorModeQuit();
	void BP_OnEditorModeStateChanged(bool IsEditing_0);
	void BP_OnOptionButtonSelected(class UHTUI_QuickMenuSettings_OptionBtn* OptionButton);
	void Completed_74A236574CC91A7111C1B0A0A4E604C5(class UCommonActivatableWidget* WidgetObject);
	void Completed_A94BF164413CC66F2B059FA218835780(class UCommonActivatableWidget* WidgetObject);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WB_QuickMenuSettings(int32 EntryPoint);
	void HandleBackAction(bool* ret);
	void OnCancelMessageBox();
	void OnMsgBoxCancelDyamicDelegate_Event();
	void OnMsgBoxSureDyamicDelegate_Event();
	void OnSureSaveMessageBox();
	void SetQuickMenuVisable(bool* isShow);
	void ShowSaveMessageBox();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_QuickMenuSettings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_QuickMenuSettings_C")
	}
	static class UWB_QuickMenuSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_QuickMenuSettings_C>();
	}
};
DUMPER7_ASSERTS_UWB_QuickMenuSettings_C;

}

