#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HTButton_Skill_M

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.BP_GetNormalPhoto
// 0x0018 (0x0018 - 0x0000)
struct W_HTButton_Skill_M_C_BP_GetNormalPhoto final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_HTButton_Skill_M_C_BP_GetNormalPhoto;

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.BP_SetNormalImage
// 0x00B0 (0x00B0 - 0x0000)
struct W_HTButton_Skill_M_C_BP_SetNormalImage final
{
public:
	struct FSlateBrush                            Img;                                               // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_W_HTButton_Skill_M_C_BP_SetNormalImage;

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.BP_SetNormalImageByTexture2D
// 0x0008 (0x0008 - 0x0000)
struct W_HTButton_Skill_M_C_BP_SetNormalImageByTexture2D final
{
public:
	class UTexture2D*                             normalImg;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_HTButton_Skill_M_C_BP_SetNormalImageByTexture2D;

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.ExecuteUbergraph_W_HTButton_Skill_M
// 0x0110 (0x0110 - 0x0000)
struct W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_normalImg;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Event_Img;                                  // 0x0050(0x00B0)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M;

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.GetPressProgress
// 0x0008 (0x0008 - 0x0000)
struct W_HTButton_Skill_M_C_GetPressProgress final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_HTButton_Skill_M_C_GetPressProgress;

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_HTButton_Skill_M_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_HTButton_Skill_M_C_PreConstruct;

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.SetBrush
// 0x0180 (0x0180 - 0x0000)
struct W_HTButton_Skill_M_C_SetBrush final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateBrush                            CurBrush;                                          // 0x00B0(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UMaterialInterface*                     CallFunc_GetBrushResourceAsMaterial_ReturnValue;   // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_HTButton_Skill_M_C_SetBrush;

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.UpdateButtonStyles
// 0x0001 (0x0001 - 0x0000)
struct W_HTButton_Skill_M_C_UpdateButtonStyles final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_HTButton_Skill_M_C_UpdateButtonStyles;

}

